1_obsidian_with-rails/app/controllers/news_controller.rb

    def index
        @news = News.page(params[:page]).per(5)
        @latest_news = News.limit(3).order(created_at: :desc)
---
SELECT  "news".* FROM "news" LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "news"
SELECT  "news".* FROM "news" WHERE "news"."created_at" = ?  ORDER BY "news"."created_at" DESC LIMIT 3  [["created_at", "t"]]

    def show

        @news = News.find(params[:id])
---
SELECT  "news".* FROM "news" WHERE "news"."id" = ? LIMIT 1  [["id", 1]]

    def new
        n = News.new
        n.title = params[:title]
        n.content = params[:content]
        n.save
---
INSERT INTO "news" ("title", "content", "published", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "jhjbjb"], ["content", ",hvhvhvbh"], ["published", "f"], ["created_at", "2016-03-02 18:15:45.703259"], ["updated_at", "2016-03-02 18:15:45.703259"]]

    def update
        @news = News.find(params[:id])
        if @news.update(title: params[:title], content: params[:content])
---
SELECT  "news".* FROM "news" WHERE "news"."id" = ? LIMIT 1  [["id", 0]]
UPDATE "news" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "news"."id" = ?  [["title", "News 3qs"], ["content", "content-news3sf"], ["updated_at", "2016-03-10 14:55:43.643972"], ["id", 6]]

    def destroy
        News.find(params[:id]).destroy
---
DELETE FROM "news" WHERE "news"."id" = ?  [["id", 6]]
SELECT  "news".* FROM "news" WHERE "news"."id" = ? LIMIT 1  [["id", 6]]